"""Fancy text for the console."""

setup_preparing = """

🚀 𝙋𝙧𝙚𝙥𝙖𝙧𝙞𝙣𝙜 𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚 𝙀𝙣𝙫𝙞𝙧𝙤𝙣𝙢𝙚𝙣𝙩 🚀

========================================
"""

setup_complete = """
========================================

✅ 𝙎𝙚𝙩𝙪𝙥 𝘾𝙤𝙢𝙥𝙡𝙚𝙩𝙚! 𝙔𝙤𝙪𝙧 𝙚𝙣𝙫𝙞𝙧𝙤𝙣𝙢𝙚𝙣𝙩 𝙞𝙨 𝙧𝙚𝙖𝙙𝙮. ✅

"""

setup_failed = """
========================================
❌ 𝙎𝙚𝙩𝙪𝙥 𝙁𝙖𝙞𝙡𝙚𝙙! 𝙋𝙡𝙚𝙖𝙨𝙚 𝙘𝙝𝙚𝙘𝙠 𝙩𝙝𝙚 𝙡𝙤𝙜𝙨 𝙖𝙣𝙙 𝙧𝙚𝙩𝙧𝙮. ❌
========================================
"""

checking_installation = """
🔍 𝘾𝙝𝙚𝙘𝙠𝙞𝙣𝙜 𝙞𝙣𝙨𝙩𝙖𝙡𝙡𝙖𝙩𝙞𝙤𝙣: {tool}
"""

installing_dependency = """
========================================
📦 𝙄𝙣𝙨𝙩𝙖𝙡𝙡𝙞𝙣𝙜 𝙙𝙚𝙥𝙚𝙣𝙙𝙚𝙣𝙘𝙮: {dependency}
========================================
"""

installing_extensions = """
========================================
🔄 𝙄𝙣𝙨𝙩𝙖𝙡𝙡𝙞𝙣𝙜 𝙑𝙎 𝘾𝙤𝙙𝙚 𝙀𝙭𝙩𝙚𝙣𝙨𝙞𝙤𝙣𝙨...
========================================
"""
